#+TITLE: Tutorial Bison Parte 2
#+AUTHOR: Lucas M. Schnorr
#+STARTUP: overview indent
#+OPTIONS: toc:2          (only include two levels in TOC)
** Tarefa #2 (Entender o funcionamento do programa =calc=)

Vamos entender a gramática de expressões aritméticas com as operações
de multiplicação e soma. Procure ver como a precedência foi codificada
na gramática. Analise os arquivos =calc.l= e =calc.y=.

Faça testes com o programa, de maneira "automatizada":

#+begin_src bash
make
echo "5*3+4" | ./calc 
#+end_src

#+RESULTS:
| make:     | 'calc'     | is          | up  | to       | date. |
| Expressão | aritmética | reconhecida | com | sucesso. |       |
| Fim.      |            |             |     |          |       |

Ou de maneira interativa:

#+begin_src bash
./calc
#+end_src

Forneça expressões aritméticas sintaticamente válidas e inválidas.

Para terminar, forneça no teclado o "fim de arquivo" teclando CRTL+D.

